yadonz/Embedded-NOTE/STM32-Series/stm32f1xx_soft-iic-12864_demo/.pack/MindMotion/MM32F103x8xB_DFP.1.4.6/SVD/MM32F103.svd
        <register>
          <name>TXDR4_B</name>
          <displayName>TXDR4_B</displayName>
          <description>TXDR4_B</description>
          <addressOffset>0x040</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR4</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FF_P</name>
          <displayName>FF_P</displayName>
          <description>FF_P</description>
          <alternateRegister>TXDR4_B</alternateRegister>
          <addressOffset>0x040</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>FF</name>
              <description>Frame format</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTR</name>
              <description>Remote transmission request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLC</name>
              <description>Data length code bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR0_P</name>
          <displayName>ACR0_P</displayName>
          <description>ACR0_P</description>
          <alternateRegister>FF_P</alternateRegister>
          <addressOffset>0x040</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR5_B</name>
          <displayName>TXDR5_B</displayName>
          <description>TXDR5_B</description>
          <addressOffset>0x044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR5</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXID0_P</name>
          <displayName>TXID0_P</displayName>
          <description>TXID0_P</description>
          <alternateRegister>TXDR5_B</alternateRegister>
          <addressOffset>0x044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>ID28</name>
              <description>Identifier bit 28</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID27</name>
              <description>Identifier bit 27</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID26</name>
              <description>Identifier bit 26</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID25</name>
              <description>Identifier bit 25</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID24</name>
              <description>Identifier bit 24</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID23</name>
              <description>Identifier bit 23</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID22</name>
              <description>Identifier bit 22</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID21</name>
              <description>Identifier bit 21</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR1_P</name>
          <displayName>ACR1_P</displayName>
          <description>ACR1_P</description>
          <alternateRegister>TXID0_P</alternateRegister>
          <addressOffset>0x044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR6_B</name>
          <displayName>TXDR6_B</displayName>
          <description>TXDR6_B</description>
          <addressOffset>0x048</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR6</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXID1_P</name>
          <displayName>TXID1_P</displayName>
          <description>TXID1_P</description>
          <alternateRegister>TXDR6_B</alternateRegister>
          <addressOffset>0x048</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>ID20</name>
              <description>Identifier bit 20</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID19</name>
              <description>Identifier bit 19</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID18</name>
              <description>Identifier bit 18</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID17</name>
              <description>Identifier bit 17</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID16</name>
              <description>Identifier bit 16</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID15</name>
              <description>Identifier bit 15</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID14</name>
              <description>Identifier bit 14</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID13</name>
              <description>Identifier bit 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR2_P</name>
          <displayName>ACR2_P</displayName>
          <description>ACR2_P</description>
          <alternateRegister>TXID1_P</alternateRegister>
          <addressOffset>0x048</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR7_B</name>
          <displayName>TXDR7_B</displayName>
          <description>TXDR7_B</description>
          <addressOffset>0x04c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR7</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA0_P</name>
          <displayName>TXDATA0_P</displayName>
          <description>TXDATA0_P</description>
          <alternateRegister>TXDR7_B</alternateRegister>
          <addressOffset>0x04c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA0</name>
              <description>DATA0</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR3_P</name>
          <displayName>ACR3_P</displayName>
          <description>ACR3_P</description>
          <alternateRegister>TXDATA0_P</alternateRegister>
          <addressOffset>0x04c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA1_P</name>
          <displayName>TXDATA1_P</displayName>
          <description>TXDATA1_P</description>
          <addressOffset>0x050</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA1</name>
              <description>DATA1</description>
            </field>
          </fields>
        </register>
        <register>
          <name>AMR0_P</name>
          <displayName>AMR0_P</displayName>
          <description>AMR0_P</description>
          <alternateRegister>TXDATA1_P</alternateRegister>
          <addressOffset>0x050</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA2_P</name>
          <displayName>TXDATA2_P</displayName>
          <description>TXDATA2_P</description>
          <addressOffset>0x054</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA2</name>
              <description>DATA2</description>
            </field>
          </fields>
        </register>
        <register>
          <name>AMR1_P</name>
          <displayName>AMR1_P</displayName>
          <description>AMR1_P</description>
          <alternateRegister>TXDATA2_P</alternateRegister>
          <addressOffset>0x054</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA3_P</name>
          <displayName>TXDATA3_P</displayName>
          <description>TXDATA3_P</description>
          <addressOffset>0x058</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA3</name>
              <description>DATA3</description>
            </field>
          </fields>
        </register>
        <register>
          <name>AMR2_P</name>
          <displayName>AMR2_P</displayName>
          <description>AMR2_P</description>
          <alternateRegister>TXDATA3_P</alternateRegister>
          <addressOffset>0x058</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA4_P</name>
          <displayName>TXDATA4_P</displayName>
          <description>TXDATA4_P</description>
          <addressOffset>0x05c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA4</name>
              <description>DATA4</description>
            </field>
          </fields>
        </register>
        <register>
          <name>AMR3_P</name>
          <displayName>AMR3_P</displayName>
          <description>AMR3_P</description>
          <alternateRegister>TXDATA4_P</alternateRegister>
          <addressOffset>0x05c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA5_P</name>
          <displayName>TXDATA5_P</displayName>
          <description>TXDATA5_P</description>
          <addressOffset>0x060</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA5</name>
              <description>DATA5</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA6_P</name>
          <displayName>TXDATA6_P</displayName>
          <description>TXDATA6_P</description>
          <addressOffset>0x064</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA6</name>
              <description>DATA6</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA7_P</name>
          <displayName>TXDATA7_P</displayName>
          <description>TXDATA7_P</description>
          <addressOffset>0x068</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA7</name>
              <description>DATA7</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA8_P</name>
          <displayName>TXDATA8_P</displayName>
          <description>TXDATA8_P</description>
          <addressOffset>0x06c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA8</name>
              <description>DATA8</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA9_P</name>
          <displayName>TXDATA9_P</displayName>
          <description>TXDATA9_P</description>
          <addressOffset>0x070</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA9</name>
              <description>DATA9</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <displayName>CDR</displayName>
          <description>CDR</description>
          <addressOffset>0x07c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <name>MODE</name>
              <description>CAN mode</description>
            </field>
          </fields>
        </register>
