yadonz/Embedded-NOTE/STM32-Series/stm32f1xx_soft-iic-12864_demo/.pack/MindMotion/MM32F103x8xB_DFP.1.4.6/SVD/MM32F103.svd
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0006</resetValue>
          <fields>
            <field>
              <name>SLV_ACTIV</name>
              <description>Slave FSM activity status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MST_ACTIV</name>
              <description>Master FSM activity status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFF</name>
              <description>Receive FIFO completely full</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFNE</name>
              <description>Receive FIFO not empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit FIFO completely empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFNF</name>
              <description>Transmit FIFO not full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTIV</name>
              <description>I2C activity status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFLR</name>
          <displayName>TXFLR</displayName>
          <description>Transmit FIFO Level Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0006</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <name>CNT</name>
              <description>Transmit FIFO level.Contains the number of valid data entires in the transmit FIFO</description>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFLR</name>
          <displayName>RXFLR</displayName>
          <description>Receive FIFO Level Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0006</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <name>CNT</name>
              <description>Receive FIFO level. Contains the number of valid data entires in the receive FIFO</description>
            </field>
          </fields>
        </register>
        <register>
          <name>HOLD</name>
          <displayName>HOLD</displayName>
          <description>SDA Hold Time Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>RX_HOLD</name>
              <description>Sets the required SDA hold time in units of ic_clk period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TX_HOLD</name>
              <description>Sets the required SDA hold time in units of ic_clk period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA</name>
          <displayName>DMA</displayName>
          <description>DMA Control Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TXEN</name>
              <description>Transmit DMA enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXEN</name>
              <description>Receive DMA enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP</name>
          <displayName>SETUP</displayName>
          <description>SDA Setup Time Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0064</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>CNT</name>
              <description>SDA setup</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GCR</name>
          <displayName>GCR</displayName>
          <description>ACK General Call Register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>GC</name>
              <description>ACK general call</description>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 event interrupt</description>
        <value>33</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>Independent watchdog</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <displayName>KR</displayName>
          <description>Key register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>KEY</name>
              <description>Key value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>Prescaler register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <name>PR</name>
              <description>Prescaler divider</description>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <displayName>RLR</displayName>
          <description>Reload register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <name>RL</name>
              <description>Watchdog counter reload value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status register</description>
          <addressOffset>0x0c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
